unit UnitConvertGreekEnglish;

{$mode ObjFPC}{$H+}
{$codepage UTF8}

interface

uses
  Classes, SysUtils, LazUTF8, UnitConvert;

type
  TKLConvertGreekEnglish = class(TKLConvert)
  protected
  public
    constructor Create;
  end;

implementation

constructor TKLConvertGreekEnglish.Create;
begin

  FScriptLeft := 'Greek';
  FScriptRight := 'Roman (English)';

  FPossibleOptions := [];
  FPairsCapital := [];
  FPairsAltGr := [];

  FPairs := [
    [';', 'q'],
    ['ς', 'w'],
    ['ε', 'e'],
    ['ἑ', 'e'],
    ['ἒ', 'e'],
    ['ἓ', 'e'],
    ['ἔ', 'e'],
    ['ἕ', 'e'],
    ['ρ', 'r'],
    ['τ', 't'],
    ['υ', 'y'],
    ['ὑ', 'y'],
    ['ὒ', 'y'],
    ['ὓ', 'y'],
    ['ὔ', 'y'],
    ['ὕ', 'y'],
    ['ῦ', 'y'],
    ['θ', 'u'],
    ['ι', 'i'],
    ['ἱ', 'i'],
    ['ἲ', 'i'],
    ['ἳ', 'i'],
    ['ἴ', 'i'],
    ['ἵ', 'i'],
    ['ῖ', 'i'],
    ['ο', 'o'],
    ['ὁ', 'o'],
    ['ὂ', 'o'],
    ['ὃ', 'o'],
    ['ὄ', 'o'],
    ['ὅ', 'o'],
    ['π', 'p'],
    ['α', 'a'],
    ['ᾳ', 'a'],
    ['ᾴ', 'a'],
    ['ᾶ', 'a'],
    ['ἁ', 'a'],
    ['ἂ', 'a'],
    ['ἃ', 'a'],
    ['ἄ', 'a'],
    ['ἅ', 'a'],
    ['σ', 's'],
    ['δ', 'd'],
    ['φ', 'f'],
    ['γ', 'g'],
    ['η', 'h'],
    ['ᾑ', 'h'],
    ['ᾔ', 'h'],
    ['ᾖ', 'h'],
    ['ἡ', 'h'],
    ['ἢ', 'h'],
    ['ἣ', 'h'],
    ['ἤ', 'h'],
    ['ἥ', 'h'],
    ['ξ', 'j'],
    ['κ', 'k'],
    ['λ', 'l'],
    ['ζ', 'z'],
    ['χ', 'x'],
    ['ψ', 'c'],
    ['ω', 'v'],
    ['ῳ', 'v'],
    ['ῴ', 'v'],
    ['ῶ', 'v'],
    ['ὡ', 'v'],
    ['ὢ', 'v'],
    ['ὣ', 'v'],
    ['ὤ', 'v'],
    ['ὥ', 'v'],
    ['β', 'b'],
    ['ν', 'n'],
    ['μ', 'm'],
    [':', 'Q'],
    ['Σ', 'W'],
    ['Ε', 'E'],
    ['Ἑ', 'E'],
    ['Ἒ', 'E'],
    ['Ἓ', 'E'],
    ['Ἔ', 'E'],
    ['Ἕ', 'E'],
    ['Ρ', 'R'],
    ['Τ', 'T'],
    ['Υ', 'Y'],
    ['Ὑ', 'Y'],
    ['Ὓ', 'Y'],
    ['Ὕ', 'Y'],
    ['Ὗ', 'Y'],
    ['Ὺ', 'Y'],
    ['Θ', 'U'],
    ['Ι', 'I'],
    ['Ἱ', 'I'],
    ['Ἲ', 'I'],
    ['Ἳ', 'I'],
    ['Ἴ', 'I'],
    ['Ἵ', 'I'],
    ['Ὶ', 'I'],
    ['Ο', 'O'],
    ['Ὁ', 'O'],
    ['Ὂ', 'O'],
    ['Ὃ', 'O'],
    ['Ὄ', 'O'],
    ['Ὅ', 'O'],
    ['Π', 'P'],
    ['Α', 'A'],
    ['ᾼ', 'A'],
    ['ᾈ', 'A'],
    ['ᾉ', 'A'],
    ['ᾊ', 'A'],
    ['ᾋ', 'A'],
    ['ᾌ', 'A'],
    ['ᾍ', 'A'],
    ['ᾎ', 'A'],
    ['ᾏ', 'A'],
    ['Σ', 'S'],
    ['Δ', 'D'],
    ['Φ', 'F'],
    ['Γ', 'G'],
    ['Η', 'H'],
    ['ῌ', 'H'],
    ['ᾘ', 'H'],
    ['ᾙ', 'H'],
    ['ᾚ', 'H'],
    ['ᾛ', 'H'],
    ['ᾜ', 'H'],
    ['ᾝ', 'H'],
    ['ᾞ', 'H'],
    ['ᾟ', 'H'],
    ['Ξ', 'J'],
    ['Κ', 'K'],
    ['Λ', 'L'],
    ['Ζ', 'Z'],
    ['Χ', 'X'],
    ['Ψ', 'C'],
    ['Ω', 'V'],
    ['ῼ', 'V'],
    ['ᾨ', 'V'],
    ['ᾩ', 'V'],
    ['ᾪ', 'V'],
    ['ᾫ', 'V'],
    ['ᾬ', 'V'],
    ['ᾭ', 'V'],
    ['ᾮ', 'V'],
    ['ᾯ', 'V'],
    ['Β', 'B'],
    ['Ν', 'N'],
    ['Μ', 'M']
  ];

end;

end.


