Repository: regs01/KLConvert
Catalog: locale/klconvert.*.po
Languages: ru

source: Version %s Icons used in the app are create by FTurtle and Roland Hahn. Lazarus: %s Free Pascal: %s Platform: %s %s Widgetset: %s
ru: Версия %s В программе используются иконки созданные FTurtle и Roland Hahn. Lazarus: %s Free Pascal: %s Platform: %s %s Widgetset: %s

# formsettings.rspageabout
source: About
ru: О программе

# formsettings.rspagekeybindings
source: Key Bindings
ru: Сочетания клавиш

# formsettings.rspagemain
source: Main
ru: Основные

# formsettings.rspagemethod
source: Method
ru: Метод

source: Color
ru: Цветная

source: Dark
ru: Тёмная

source: Dark2
ru: Тёмная2

source: Gray
ru: Серая

source: Light
ru: Светлая

source: Exit
ru: Выход

# tfrmmain.cactionconvert.caption
source: Convert
ru: Конвертировать

# tfrmmain.cactionconvert.hint
source: Convert selection
ru: Сконвертировать выделенный текст

source: Copy
ru: Скопировать

source: Copy selection into clipboard
ru: Скопировать выделенный текст в буфер обмена

# tfrmmain.cactionlocalconvert.caption
source: Convert
ru: Конвертировать

# tfrmmain.cactionlocalconvert.hint
source: Convert selection
ru: Сконвертировать выделенный текст

# tfrmmain.cactionlocallowercase.caption
source: lower case
ru: строчные

# tfrmmain.cactionlocallowercase.hint
source: Transform into lower case
ru: Преобразовать в строчные

# tfrmmain.cactionlocalpropercase.caption
source: Proper Case
ru: Каждое Слово С Прописной

# tfrmmain.cactionlocalpropercase.hint
source: Transform into Proper Case
ru: Преобразовать регистр каждого слова в Прописной

# tfrmmain.cactionlocalswapcase.caption
source: Swap case
ru: пЕРЕКЛЮЧИТЬ рЕГИСТР

# tfrmmain.cactionlocalswapcase.hint
source: Transform swapping the case
ru: Преобразовать регистр в пРОТИВОПОЛОЖНЫЙ

# tfrmmain.cactionlocaluppercase.caption
source: UPPER CASE
ru: ПРОПИСНЫЕ

# tfrmmain.cactionlocaluppercase.hint
source: Transform into UPPER CASE
ru: Преобразовать в ПРОПИСНЫЕ

# tfrmmain.cactionlowercase.caption
source: lower case
ru: строчные

# tfrmmain.cactionlowercase.hint
source: Transform into lower case
ru: Преобразовать в строчные

source: Paste
ru: Вставить

# tfrmmain.cactionpaste.hint
source: Paste from clipboard
ru: Вставить из буфера обмена

# tfrmmain.cactionpropercase.caption
source: Proper Case
ru: Каждое Слово С Прописной

# tfrmmain.cactionpropercase.hint
source: Transform into Proper Case
ru: Преобразовать регистр каждого слова в Прописной

# tfrmmain.cactionsettings.caption
source: Settings
ru: Настройки

# tfrmmain.cactionsettings.hint
source: Settings
ru: Настройки

source: Show
ru: Показать

# tfrmmain.cactionswapcase.caption
source: Swap case
ru: пЕРЕКЛЮЧИТЬ рЕГИСТР

# tfrmmain.cactionswapcase.hint
source: Transform swapping the case
ru: Преобразовать регистр в пРОТИВОПОЛОЖНЫЙ

# tfrmmain.cactionuppercase.caption
source: UPPER CASE
ru: ПРОПИСНЫЕ

# tfrmmain.cactionuppercase.hint
source: Transform into UPPER CASE
ru: Преобразовать в ПРОПИСНЫЕ

source: Main ToolBar
ru: Основная панель

source: Apply
ru: Применить

# tfrmsettings.btncancel.caption
source: Cancel
ru: Отмена

# tfrmsettings.btnsave.caption
source: Save
ru: Сохранить

# tfrmsettings.caption
source: Settings
ru: Настройки

source: AltGr symbols
ru: Символы AltGr

source: Add to system Autostart
ru: Добавить в автозапуск

source: Capital symbols
ru: Символы Caps Lock

source: Switch keyboard layout
ru: Изменить раскладку клавиатуры

source: Launch minimized
ru: Запускать свёрнутым

source: Show icon in tray
ru: Показывать иконку в трее

source: Convert layouts:
ru: Конвертация раскладок:

source: Emulate selected keystroke to copy selection to clipboard. If there is any text before operation in Clipboard it will be backed up and restored after completion. Backing up larger elements is pointless, as image might take 10 seconds or more. So anything else in Clipboard will be lost in this case.
ru: Эмулировать нажатие выбранного сочетания клавиш для копирования в Буфера обмена. Если в буфере присутствует какой-то текст, то он будет сохранён и восстановлен по окончании операции. Попытки сохранения более крупных операций не имеют смысла, ибо их чтение может занять десятки секунд. Так что всё остальное в Буфере обмена будет утеряно.

source: Input method:
ru: Метод ввода:

source: Primary selection is a special clipboard that contains last selection. Simple solution, but not every application reports to Primary Selection. WINE does not report to Primary Selection and so as some qt and GTK4 application.
ru: Первичное выделение - это специальный буфер обмена, который содержит последние выделение. Простое решение, но не все приложения докладывают в буфер Первичного выделения. WINE не докладывает, а так же некоторые qt и GTK4 приложения.

source: Layout 1:
ru: Раскладка 1:

source: Layout 2:
ru: Раскладка 2:

source: Language:
ru: Язык:

source: Emulate selected keystroke to insert output from Clipboard.
ru: Эмулировать нажатие выбранного сочетания клавиш для вставки из Буфера обмена.

source: Output method:
ru: Метод вывода:

source: Just copy back into Primary Selection, so user can insert it manually with middle mouse click. Unfortunetely there is no way to paste from Primary Selection with keyboard.
ru: Просто копируем текст обратно в буфер Первичного выделения, так что пользователь может сам вставить текст вручную при помощи средней кнопки мыши. К сожалению, возможности вставить Первичное выделение с использованием клавиатуры нет.

source: Emulate keyboard typing. Not always reliable. X11 might lag and lose some keystrokes sometimes.
ru: Эмулировать ввод текста нажатием кнопок. Не всегда надёжно. X11 может пролагивать терять некоторые нажатия.

source: Copy to clipboard
ru: Копирование в буфер

# tfrmsettings.rbinputprimaryselection.caption
source: Primary selection
ru: Первичное выделение (Primary selection)

source: Detect destination layout
ru: Определить раскладку

source: Switch between two layouts:
ru: Переключаться между двух раскладок:

# tfrmsettings.rboutputclipboard.caption
source: Paste from clipboard
ru: Вставка из буфера

# tfrmsettings.rboutputprimaryselection.caption
source: Primary selection
ru: Первичное выделение (Primary selection)

source: Type in output
ru: Набор текста

source: Failed to write into settings file: %s
ru: Ошибка записи в файл настроек: %s
